# 학생 정보 테이블을 컨테이너 자료형으로 만들기


a = ({'회원번호': 'S21-0001'},
     {'이름': '최성훈'},
     {'성별': 'M'},
     {'전공': '디자인'},
     {'연락처': '010-1234-5678'},
     {'메일': 'hun@gmail.com'},
     {'취미': ['농구', '음악']})

b = ({'회원번호': 'S21-0002'},
     {'이름': '탁영우'},
     {'성별': 'M'},
     {'전공': '바리스트'},
     {'연락처': '010-1567-5678'},
     {'메일': 'yeong@gmail.com'},
     {'취미': ['축구']})

c = ({'회원번호': 'S21-0003'},
     {'이름': '황진영'},
     {'성별': 'W'},
     {'전공': '음악'},
     {'연락처': '010-1234-5468'},
     {'메일': 'jin@gmail.com'},
     {'취미': ['수영', '코딩']})

st = [a, b, c]

for s in st:
     for t in s:
          for key in t:
               print(f'{key} : {t[key]}')

     print('-'*30)

